app/services/create_cart_service.rb

  def cart_creation
    @cart = Cart.create!(cart_params)
---
INSERT INTO "carts" ("users_id", "shops_id", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["users_id", 1], ["shops_id", 1], ["total_price", 100.0], ["created_at", "2021-05-29 09:53:21.073968"], ["updated_at", "2021-05-29 09:53:21.073968"]]

  def create_cart_items
    params[:cart_items].each do |citem|
      CartItem.create!(citem.merge!({carts_id: @cart.id}))
---
INSERT INTO "cart_items" ("carts_id", "shop_items_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["carts_id", 2], ["shop_items_id", 1], ["quantity", 1], ["created_at", "2021-05-29 09:53:21.134563"], ["updated_at", "2021-05-29 09:53:21.134563"]]

  def shop_cart_items_list
    cart_item_id = params[:cart_items].map{|i| i[:shop_items_id]}
    shop = Shop.find(params[:shops_id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]