app/controllers/carts_controller.rb

INSERT INTO "carts" ("users_id", "shops_id", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["users_id", 1], ["shops_id", 1], ["total_price", 100.0], ["created_at", "2021-05-29 09:51:08.586140"], ["updated_at", "2021-05-29 09:51:08.586140"]]
---
  def add_to_cart
    puts cart_params
    cart = CreateCartService.new(cart_params).create_cart