app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.valid?
      user.save!
---
INSERT INTO "users" ("name", "email", "password", "phone", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]